name: "argmax-model"
backend: "python"
max_batch_size: 0

input [
    {
        name: "probabilities"
        data_type: TYPE_FP32
        dims: [ 3 ]
    }
]

output [
    {
        name: "labels"
        data_type: TYPE_INT64
        dims: [ 1 ]
    }

]

instance_group [
    {
        count: 1
        kind: KIND_CPU
    }
]